Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/types_residence_permission_non_eea_nationals.html.txt.tmx
Source language: en
Languages: ga

source: Types of residence permission for non-EEA nationals
ga: Cineálacha an cheada cónaithe do náisiúnaigh neamh-LEE

source: If you are not a citizen of the European Economic Area (EEA) or Switzerland, there are various types of residence rights or permission to remain that allow you to live in Ireland
ga: Mura saoránach thú den Limistéar Eacnamaíoch Eorpach (LEE) nó den Eilvéis, tá cineálacha ar leith de chearta cónaithe nó de chead chun fanacht ann a ligeann duit cónaí n Éirinn

source: Permission to remain is granted by the Department of Justice and Equality and consists of a special stamp endorsed on your passport
ga: Deonaíonn an Roinn Dlí agus Cirt agus Comhionannais cead chun fanacht agus stampa speisialta atá ann a fhormhuinítear ar do phas

source: This is usually called a residence stamp
ga: Is gnách go dtugtar stampa cónaithe air seo

source: The various types of stamp and their meanings are covered in detail below
ga: Cumhdaítear thíos go mionsonraithe na cineálacha éagsúla de stampa agus na cialla atá leo

source: You can read more about the general rules on residence in our document on residence rights for non-EEA nationals
ga: Féadfaidh tú níos mó a léamh faoi na rialacha ginearálta maidir le cónaí inár gcáipéis ar chearta cónaithe do náisiúnaigh neamh-LEE

source: The Irish Naturalisation and Immigration Service (INIS) also publishes extensive information on its website, inis.gov.ie
ga: Foilsíonn Seirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) faisnéis fhairsing, chomh maith, ar a láithreán gréasáin, inis.gov.ie

source: If you have an employment permit, you have permission to remain in Ireland for as long as your employment permit is valid
ga: Má tá cead fostaíochta agat, tá cead agat chun fanacht in Éirinn dá fhad agus a bhíonn do chead fostaíochta bailí

source: You will get a stamp number 1 on your passport
ga: Gheobhaidh tú stampa uimhir1 ar do phas

source: This stamp gives you permission to remain on condition that you do not enter any employment unless you or your employer have obtained an employment permit
ga: Tugann an stampa seo cead duit fanacht ar an gcoinníoll nach n-iontrálann tú aon fhostaíocht mura bhfuair tú féin nó d’fhostóir cead fostaíochta

source: You will need a business permission if you wish to establish or engage in business in Ireland
ga: Teastóidh cead gnó uait más mian leat gnó a bhunú nó tabhairt faoi ghnó in Éirinn

source: A business permission is granted for 1 year initially
ga: Má tá cead gnó agat, gheobhaidh tú stampa uimhir 1 ar do phas, chomh maith

source: If you have a business permission, you will also get a stamp number 1 on your passport
ga: Tugann an stampa seo an cead duit fanacht in Éirinn dá fhad a bhíonn do chead gnó bailí

source: Since 16 March 2016 the business permission scheme has been suspended
ga: Ó 16 Márta 2016, cuirtear an scéim cead gnó ar fionraí

source: The Immigrant Investor Programme provides investment options ranging from €500,000 to €1 million which allows approved non-EEA investors and their immediate family enter Ireland on multi-entry visas and remain here for up to 5 years
ga: Soláthraíonn an Clár Infheisteoirí Inimirceacha roghanna infheistíochta ó €500,000 go dtí €1 milliún a cheadaíonn d’infheisteoirí faofa neamh-LEE agus a neasteaghlach chun Éire a iontráil ar víosaí iliontrála agus fanacht anseo ar feadh a fhad le cúig bliana

source: The Start-up Entrepreneur Programme allows non-EEA participants with an innovative business proposal and funding or financial backing of at least €50,000 to come and set up a business in Ireland
ga: Ceadaíonn an Clár Fiontraithe Gnólachtaí Nuathionscanta rannpháirtithe neamh-LEE a bhfuil togra nuálach gnó agus cistiú nó tacaíocht airgeadais €50,000 ar a laghad acu teacht go hÉirinn agus gnólacht a bhunú ann

source: This scheme does not apply to retail, catering, personal services or similar businesses – see 'Business permission holders' above
ga: Ní bhaineann an scéim seo le miondíol, lónadóireacht, seirbhísí pearsanta nó gnólachtaí dá macasamhail – féach ‘Sealbhóirí cead gnó’ thuas

source: Successful applicants to both programmes will be granted a residence permission for 2 years initially
ga: Deonófar cead cónaithe d’iarratasóirí rathúla ar an dá chlár ar feadh dhá bhliain i dtosach

source: You can read more in our document, Coming to set up a business or invest in Ireland
ga: Is féidir leat níos mó a léamh inár gcáipéis, Teacht go hÉirinn le hinfheistiú nó gnó a chur ar bun

source: If you are a non-EEA national coming to study in Ireland you must be enrolled in a full-time course on the Interim List of Eligible Programmes (ILEP)
ga: Más náisiúnach neamh-LEE thú atá ag teacht chun staidéar a dhéanamh in Éirinn, ní mór duit a bheith cláraithe i gcúrsa lánaimseartha faoin Liosta Eatramhaigh de Chláir Incháilithe (ILEP)

source: If you are attending a course on the ILEP you will have stamp number 2 endorsed on your passport
ga: Má tá tú ag freastal ar chúrsa ar an ILEP faoi cheann de na cláir thuas, formhuineofar stampa uimhir 2 ar do phas

source: You will be allowed to take up casual employment of up to 20 hours part-time work per week in term time or up to 40 hours per week during holiday periods (June to September and 15 December to 15 January)
ga: Ceadófar duit glacadh le fostaíocht ócáideach a mhéid le hobair pháirtaimseartha 20 uair an chloig sa tseachtain i rith thréimhse an téarma nó a mhéid le 40 uair an chloig sa tseachtain i rith thréimhsí saoire (Meitheam go Meán Fómhair agus 15 Nollaig go 15 Eanáir)

source: If you are not attending a course on the Interim List of Eligible Programmes, you will not be entitled to take up part-time work or engage in any business or profession
ga: Mura bhfuil tú ag freastal ar chúrsa ar an ILEP, ní bheidh tú i dteideal glacadh le hobair pháirtaimseartha nó tabhairt faoi aon ghnó nó gairm

source: You will get stamp number 2A on your passport
ga: Gheobhaidh tú stampa uimhir 2A ar do phas

source: Third Level Graduate Scheme: Non-EEA students who have graduated with a degree at level 7 to 10 from an Irish third-level institution and have a current Certificate of Registration may be permitted to apply for the Third Level Graduate Scheme (pdf)
ga: Scéim Céimithe Tríú Leibhéal: B’fhéidir go mbeidh cead ag mic léinn neamh-LEE a bhain céim amach idir leibhéal 7 agus 10 ó institiúid Éireannach tríú leibhéal agus a bhfuil Deimhniú Cláraithe reatha iarratas a dhéanamh ar an Scéim Céimithe Tríú Leibhéal (pdf)

source: This scheme provides an extension of their permission to remain for 6 or 12 months to allow them to seek employment and obtain a Critical Skills Employment Permit or General Employment Permit
ga: Soláthraíonn an scéim seo síneadh ar a gcead stampa 2 ar feadh 6 nó 12 mhí chun ligean dóibh fostaíocht a lorg agus Cead Fostaíochta Scileanna Criticiúla nó Cead Fostaíochta Ginearálta a fháil

source: If they are granted permission to remain, from 1 February 2016 they will get stamp 1G
ga: Má fhaigheann siad cead fanacht, gheobhaidh siad stampa 1G ó 1 Feabhra 2016

source: Spouse or civil partner of an Irish national
ga: Céile nó páirtnéir sibhialta náisiúnaigh Éireannaigh

source: If you are a non-EEA national married to, or in a recognised civil partnership with, an Irish national you do not have an automatic right to live in Ireland
ga: Más náisiúnach neamh-LEE thú atá pósta le, nó i bpáirtnéireacht aitheanta shibhialta le náisiúnach Éireannach, ní thugtar an ceart duit go huathoibríoch chun cónaí in Éirinn

source: Depending on your current immigration status, you apply for permission to live in Ireland as follows:
ga: Ag brath ar do stádas reatha inimirce, déanann tú iarratas ar chead chun cónaí in Éirinn tríd an méid a leanas a dhéanamh:

source: • If you currently have permission to live in Ireland, you should go with your Irish national spouse or civil partner to register with your local immigration officer as the spouse or civil partner of an Irish national
ga: • Má tá cead agat faoi láthair chun cónaí in Éirinn, ba cheart duit agus do chéile nó do pháirtnéir sibhialta Éireannach dul chun clárú le d’oifig áitiúil inimirce mar chéile nó mar pháirtnéir sibhialta náisiúnaigh Éireannaigh

source: • If you do not have permission to live in Ireland, you must apply in writing to the Marriage to Irish National Section of the Irish Naturalisation and Immigration Service – see 'Where to apply' below
ga: • Mura bhfuil cead agat chun cónaí in Éirinn, ní mór duit iarratas a dhéanamh i scríbhinn le Rannóg um Pósadh le Náisiúnach Éireannach de chuid Seirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: You can find details of the application procedures for spouses and civil partners of Irish nationals on inis.gov.ie
ga: Féadfaidh tú teacht ar shonraí ar na nósanna imeachta iarratais do chéilí agus do pháirtnéirí sibhialta náisiúnach Éireannach ar inis.gov.ie

source: Once you have permission to live in Ireland on the basis of marriage or civil partnership with an Irish national you may get a stamp 4 on your passport and you do not need an employment permit or business permission
ga: A luaithe a bhíonn cead agat chun cónaí in Éirinn ar bhonn pósta nó páirtnéireacht shibhialta le náisiúnach Éireannach, féadfaidh tú stampa 4 a fháil ar do phas agus ní gá duit cead fostaíochta nó cead gnó a fháil

source: If you are a non-EEA family member of an EEA or Swiss citizen, who meets the requirements as laid out in the European Communities (Free Movement of Persons) Regulations 2015, you must apply to the Irish Naturalisation and Immigration Service for permission to remain under EU Treaty Rights
ga: Má duine muinteartha neamh-LEE thú de chuid saoránach LEE nó Eilvéiseach, a chomhlíonann na ceanglais a leagtar amach i Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015, ní mór duit iarratas a dhéanamh ar Sheirbhís Eadóirseachta agus Inimirce na hÉireann chun cead a fháil chun fanacht faoi Chearta Chonradh an AE

source: When you register with your local registration office the Certificate of Registration that you receive will be a residence card with the wording 4 EU FAM (that is, the residence card of a family member of an EU citizen)
ga: Nuair a chláraíonn tú le le d’oifig áitiúil clárúcháin, cárta cónaithe a bheidh sa Deimhniú Clárúcháin a gheobhaidh tú ar a bhfuil na focail 4 EU FAM (is é sin, cárta cónaithe duine mhuinteartha shaoránach an AE)

source: As a holder of this card 4 EU FAM, you will be visa-exempt even if you are a visa-required national and you do not need an employment permit or business permission
ga: Nuair a bhíonn tú i seilbh an chárta seo, 4 EU FAM, beidh tú díolmhaithe ó víosa a fháil fiú más náisiúnach thú óna dteastaíonn víosa agus ní gá duit cead fostaíochta ná cead gnó a fháil

source: Non-EEA nationals who are in de facto relationships must have permission to remain in the State
ga: Ní mór go bhfuil cead ag náisiúnaigh neamh-LEE atá i gcaidreamh de facto chun fanacht sa Stát

source: They can apply for a de facto partnership immigration permission (DFPIP) as follows:
ga: Féadfaidh siad iarratas a dhéanamh ar chead inimirce páirtnéireachta de facto (DFPIP) mar seo a leanas:

source: • A non-EEA national whose partner is an Irish national must provide proof of a durable relationship of at least 1 year
ga: • Ní mór do náisiúnach neamh-LEE, ar náisiúnach Éireannach a bpáirtnéir, cruthúnas a sholáthar i leith caidreamh buan a mhair dhá bhliain, ar a laghad

source: If the non-EEA national is granted permission to remain they are not required to have an employment permit
ga: Má dheonaítear cead don náisiúnach neamh-LEE chun fanacht, ní cheanglaítear orthu cead fostaíochta a bheith acu

source: • If you are a non-EEA national whose partner is an EU national you can apply for a residence card under EU Treaty Rights if you have proof of a durable relationship of at least 2 years
ga: • Más náisiúnach neamh-LEE thú, ar náisiúnach den AE do pháirtnéir, féadfaidh tú iarratas a dhéanamh ar chárta cónaithe faoi Chearta Chonradh an AE má tá cruthúnas agat i leith caidreamh buan a mhair dhá bhliain, ar a laghad

source: If you are granted permission to remain you will not need an employment permit
ga: Má dheonaítear cead duit chun fanacht, ní cheanglaítear ort cead fostaíochta a bheith agat

source: • A non-EEA national whose partner is also a non-EEA national must provide evidence of a durable relationship of at least 1 year and valid permission to reside
ga: • Ní mór do náisiúnach neamh-LEE, ar náisiúnach neamh-LEE a bpáirtnéir chomh maith, cruthúnas a sholáthar i leith caidreamh buan a mhair dhá bhliain, ar a laghad agus ní mór dóibh cead fostaíochta a bheith acu chun oibriú

source: The non-EEA national partner (the sponsor) must have a stamp 1, 4 or 5 residence permission
ga: Ní mór go bhfuil cead cónaithe stampa 1, 4 nó 5 ag páirtnéir an náisiúnaigh neamh-LEE (an t-urraitheoir)

source: Non-EEA nationals with stamp 2 or 3 permission are not eligible to be sponsors
ga: Níl náisiúnaigh neamh-LEE a bhfuil cead stampa 2 nó 3 acu i dteideal bheith ina n-urraitheoirí

source: There is no application form and you should apply in writing in the form of a letter. You can find the guidelines for applicants, details of the evidence to be submitted and a list of frequently asked questions on inis.gov.ie
ga: Féadfaidh tú teacht ar na treoirlínte d’iarratasóirí, sonraí ar an bhfianaise atá le seoladh ar aghaidh agus ar liosta de cheisteanna coitianta ar inis.gov.ie

source: Visitors and others who are not allowed to work
ga: Cuairteoirí agus daoine eile nach bhfuil cead oibre acu

source: If you are coming to Ireland as a visitor, a tourist, the spouse, civil partner or dependant of an employment permit holder, or in order to receive medical treatment, you will get a stamp number 3 on your passport
ga: Má tá tú ag teacht go hÉirinn mar chuairteoir, turasóir, céile, páirtnéir sibhialta nó cleithiúnaí de chuid sealbhóir cead fostaíochta nó chun cóireáil leighis a fháil, gheobhaidh tú stampa uimhir 3 ar do phas

source: If you have a stamp 3 you will not be entitled to work or engage in any business or profession while in Ireland
ga: Má tá stampa 3 agat, ní bheidh tú i dteideal oibriú nó tabhairt faoi aon ghnólacht nó ghairm fad a bhíonn tú in Éirinn

source: The length of time that this stamp is valid will depend on your circumstances
ga: Braithfidh an fad ama dá mbeidh an stampa seo bailí ar do chúinsí

source: Guidelines to the immigration arrangements for ministers of religion and lay volunteers are on inis.gov.ie For further information contact Unit2ResidenceDivision@justice.ie
ga: Tá treoirlínte ar na socruithe inimirce do mhinistrí reiligiúin agus oibrithe deonacha tuata ar fáil ar inis.gov.ie. Chun teacht ar bhreis faisnéise, déan teagmháil le Unit2ResidenceDivision@justice.ie

source: Once they are legally resident in the State, spouses, recognised partners, civil partners and dependants of holders of Critical Skills Employment Permits, former Green Card permits and researchers can apply for a Dependant/Partner/Spousal Employment Permit
ga: A luaithe a bhíonn cónaí dlíthiúil orthu sa Stát, féadfaidh céilí, páirtnéirí aitheanta, páirtnéirí sibhialta agus cleithiúnaithe sealbhóirí Ceadanna Fostaíochta Scileanna Criticiúla, iar-cheadanna an Chárta Ghlais agus taighdeoirí iarratas a dhéanamh ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: All non-EEA doctors registering with their local immigration office on or after 1 March 2014, whether for the first time or renewing their immigration permission, must have an employment permit
ga: Ní mór go mbeidh cead fostaíochta ag gach dochtúir neamh-LEE a chláraíonn lena n-oifig áitiúil inimirce an 1 Márta 2014 nó ina dhiaidh sin, cibé acu den chéad uair nó má tá a gcead inimirce á athnuachan acu

source: Their stamp 1 immigration permission will be for 6 months or 12 months subject to the duration of their employment contract
ga: Mairfidh a gcead inimirce stampa 1 6 mhí nó 12 mhí faoi réir fhad a gconartha fostaíochta

source: Doctors who already have stamp 4 can have their stamp 4 renewed for 2 years
ga: Sa chás go bhfuil stampa 4 ag dochtúirí cheana féin, féadtar seo a athnuachan ar feadh dhá bhliain

source: You can read about the immigration arrangements for non-EEA doctors, including locum doctors, on inis.gov.ie
ga: Is féidir leat tuilleadh a léamh faoi na socruithe inimirce do dhochtúirí neamh-LEE, lena n-áirítear dochtúirí ionaid, ar inis.gov.ie

source: The immigration permission stamp 0 is granted to people who are coming to Ireland for a limited and specific stay
ga: Deonaítear stampa 0 cead inimirce do dhaoine atá ag teacht go hÉirinn ar fhanacht theoranta agus shonrach

source: They must be self-sufficient and may not get State benefits if they have stamp 0 permission
ga: Ní mór go bhfuil siad féinchothaitheach agus ní féidir leo sochair Stáit a fháil má bhíonn cead stampa 0 acu

source: • Visiting academics: They may work here for less than 9 months and must be paid from outside the State
ga: • Acadóirí ar cuairt: Féadfaidh siad oibriú anseo ar feadh níos lú ná 9 mí agus ní mór iad a íoc ó áit lasmuigh den Stát

source: • Older dependent relatives: The financial criteria to sponsor an older dependent relative are set out in Chapter 18 of the family reunification policy document (pdf)
ga: • Gaolta cleithiúnacha eile: Leagtar amach na critéir airgeadais chun gaol cleithiúnach níos sine a urrú i gCaibidil 18 den cháipéis bheartais um athaontú teaghlaigh (pdf)

source: • Persons of independent means: They must have an annual income of at least €50,000 and access to a lump sum to cover any unforeseen large expenses
ga: • Daoine ar mhaoin neamhspleách: Ní mór go bhfuil ioncam bliantúil ar a laghad €50,000 acu, anuas ar rochtain ar chnapshuim chun íoc as aon chostais mhóra nach raibh coinne leo

source: More information about the stamp 0 permission is available on inis.gov.ie
ga: Tá breis faisnéise ar fáil faoi chead stampa 0 ar inis.gov.ie

source: Parents of Irish citizen children
ga: Tuismitheoirí de leanaí ar saoránaigh Éireannacha iad

source: Under the Irish Born Child Scheme (IBC/05) a number of non-EEA national parents of children born in the State prior to 1 January 2005 were granted permission to remain for an initial period of 2 years
ga: Faoin Scéim um Leanaí a Rugadh in Éirinn (IBC/05) tugadh cead fanachta tosaigh de 2 bhliain, do roinnt tuismitheoirí neamh-LEE le leanaí a rugadh sa Stát roimh an 1 Eanáir 2005

source: Many of them had their permission to remain extended subject to certain conditions in 2007, 2010 and 2013
ga: I 2007, 2010 agus 2013 síníodh an cead fanachta le haghaidh mórán díobh faoi réir coinníollacha áirithe

source: On 8 March 2011 the European Court of Justice (ECJ) ruled in the Zambrano case C 34/09, that an EU member state may not refuse the non-EU parents of a dependent child who is a citizen of, and resident in, an EU member state the right to live and work in that member state
ga: Ar 8 Márta 2011 rialaigh an Chúirt Cheartais Eorpach (CCE) ar an gcás Zambrano C 34/09, nach féidir le haon bhallstát Eorpach diúltú do thuismitheoirí neamh-AE de leanbh cleithiúnach ar shaoránach é, agus a bhfuil cónaí air, i mballstát Eorpach ceart cónaithe agus oibre sa bhallstát sin

source: Non-EEA parents who meet the Zambrano criteria may be given permission to live and work in Ireland without the requirement for an employment permit or business permission
ga: Má chomhlíonann siad critéir Zambrano, d’fhéadfaí go dtabharfaí cead do na tuismitheoirí neamh-LEE cónaí agus oibriú in Éirinn gan cheanglais cead fostaíochta nó cead gnó

source: From 1 October 2015, there is a new application procedure for non-EEA parents applying for permission to remain based on parentage of an Irish citizen child
ga: Ó Deireadh Fómhair 2015, tá nós imeachta iarratais nua do thuismitheoirí neamh-LEE a dhéanann iarratais ar chead fanachta bunaithe ar thuismíocht linbh ar shaoránaigh Éireannacha é/í

source: Some foreign nationals who are victims of domestic violence may currently have an immigration status which is dependent on the person carrying out the domestic violence
ga: D’fhéadfadh go bhfuil stádas inimirce ag roinnt náisiúnaigh iasachta faoi láthair atá mar íospartaigh d’fhoréigean teaghlaigh a bhraitheann ar an duine a thugann faoin bhforéigean teaghlaigh

source: In these cases the foreign national may apply for independent immigration status as a victim of domestic violence
ga: Sna cásanna seo, féadfaidh an náisiúnach iasachta iarratas a dhéanamh ar stádas neamhspleách inimirce mar íospartach d’fhoréigean teaghlaigh

source: You can read the immigration guidelines for victims of domestic violence (pdf)
ga: Féadfaidh tú na treoirlínte inimirce d’íospartaigh foréigean teaghlaigh a léamh (pdf)

source: Victims of human trafficking
ga: Íospartaigh de gháinneáil ar dhaoine

source: A non-EEA national who has been identified as a suspected victim of human trafficking may be granted permission to remain in Ireland for up to 60 days
ga: Féadtar cead a dheonú do náisiúnach neamh-LEE a sainaithníodh mar íospartach de gháinneáil ar dhaoine chun fanacht in Éirinn ar feadh a fhad le 60 lá

source: In certain cases such a non-EEA national may be granted further periods of temporary residence in Ireland
ga: I gcásanna áirithe, féadtar tréimhsí breise de chónaitheacht shealadach in Éirinn a dheonú don náisiúnach neamh-LEE sin

source: The person must have been identified as a suspected victim by a superintendent or higher-ranked Garda in the Garda National Immigration Bureau (GNIB)
ga: Ní mór gur sainaithníodh an duine mar íospartach amhrasta ag ceannfort nó ag Garda a bhfuil céim níos airde bainte amach aige/aici i mBiúró Náisiúnta an Gharda Síochána um Inimirce (BNGSI)

source: Full details are in Administrative Immigration Arrangements for the Protection of Victims of Human Trafficking (pdf)
ga: Tá na sonraí go léir ar fáil ar Shocruithe Riaracháin Inimirce chun Íospartaigh de Gháinneáil ar Dhaoine a Chosaint (pdf)
